
// <!-- 電力会社名 -->
// エリアごとに配列に入れてます
const areaList = 
  {
    "関東エリア":[
                "エバーグリーン・リテイリング",
                "株式会社フラットエナジー株式会社",
                "ジニーエナジー合同会社",
                "株式会社東急パワーサプライ",
                "東京電力エナジーパートナー株式会社(従量電灯B)",
                "東京電力エナジーパートナー株式会社(スタンダードSプラン)",
                "東北電力株式会社（関東エリア料金）",
                "中国電力株式会社（関東エリア料金）",
                "株式会社Ｆ－Ｐｏｗｅｒ(ピタでん)",
                "ＴＲＥＮＤＥ株式会社(あしたでんき)",
                "株式会社オカモト(0円でんき)",
                "株式会社Ｌｏｏｏｐ",
                "ＴＥＰＣＯライフサービス株式会社",
                "楽天エナジー株式会社",
                "株式会社イーネットワークシステムズ(パレット電気)",
                "アンフィニ株式会社(Japan電力)",
                "ＥＮＥＯＳ株式会社（ＪＸＴＧエネルギー株式会社）",
                "ＨＴＢエナジー株式会社(シンプルプラン)",
                "ＨＴＢエナジー株式会社(東京レギュラープランB)",
                "ＫＤＤＩ株式会社(auでんき)",
                "ＫＤＤＩ株式会社(UQでんき)",
                "ＳＢパワー株式会社(おうちでんき)",
                "ＳＢパワー株式会社(くらしでんき)",
                "株式会社ＰｉｎＴ",
                "株式会社グランデータ(ライフでんき)",
                "株式会社グランデータ(セレクトでんき)",
                "東京ガス株式会社",
                "ＭＣリテールエナジー株式会社(まちエネ)",
                "株式会社ＣＤエナジーダイレクト",
                "株式会社アイ・グリッド・ソリューションズ(スマ電)",
                "株式会社ミツウロコヴェッセル",
                "丸紅新電力株式会社",
                "九電みらいエナジー株式会社",
                "株式会社エルピオ(スタンダードライト)",
                "出光興産株式会社",
                "シン・エナジー株式会社",
                "株式会社ＮＥＸＴ ＯＮＥ（ラストワンマイル）",
                "株式会社サイサン(エネワンでんき)",
                "株式会社リミックスポイント",
                "株式会社エネアーク関東",
                "ネクストエナジー・アンド・リソース株式会社(GREENaでんき)",
                "エフビットコミュニケーションズ株式会社",
                "ファミリーエナジー合同会社",
                "みんな電力株式会社",
                "生活協同組合コープみらい",
                "株式会社エフエネ(エフエネ電気)",
                "株式会社エフエネ(カルガモでんき)",
                "J:COM株式会社",
                "株式会社シナネン"
                ],
    "中部エリア":[
                "エバーグリーン・リテイリング株式会社",
                "フラットエナジー株式会社",
                "ジニーエナジー合同会社",
                "東京電力エナジーパートナー株式会社(中部エリア料金)",
                "中部電力ミライズ株式会社(おとくプラン(40A))",
                "中部電力ミライズ株式会社(ポイントプラン)",
                "株式会社Ｆ－Ｐｏｗｅｒ(ピタでん)",
                "ＴＲＥＮＤＥ株式会社(あしたでんき)",
                "株式会社オカモト(0円でんき)",
                "株式会社Ｌｏｏｏｐ",
                "ＴＥＰＣＯライフサービス株式会社",
                "楽天エナジー株式会社",
                "株式会社イーネットワークシステムズ(パレット電気)",
                "アンフィニ株式会社(Japan電力)",
                "ＥＮＥＯＳ株式会社（ＪＸＴＧエネルギー株式会社）",
                "ＨＴＢエナジー株式会社(中部シンプルプラン)",
                "ＨＴＢエナジー株式会社(中部レギュラープランB)",
                "ＫＤＤＩ株式会社(auでんき)",
                "ＫＤＤＩ株式会社(UQでんき)",
                "ＳＢパワー株式会社(おうちでんき)",
                "ＳＢパワー株式会社(くらしでんき)",
                "株式会社ＰｉｎＴ",
                "株式会社グランデータ(ライフでんき)",
                "株式会社グランデータ(セレクトでんき)",
                "東邦ガス株式会社",
                "ＭＣリテールエナジー株式会社(まちエネ)",
                "株式会社アイ・グリッド・ソリューションズ(スマ電)",
                "株式会社ミツウロコヴェッセル",
                "丸紅新電力株式会社",
                "株式会社エルピオ",
                "出光興産株式会社",
                "シン・エナジー株式会社",
                "株式会社ＮＥＸＴ ＯＮＥ（ラストワンマイル）",
                "株式会社サイサン(エネワンでんき)",
                "株式会社リミックスポイント",
                "株式会社エネアーク中部",
                "ネクストエナジー・アンド・リソース株式会社(GREENaでんき)",
                "エフビットコミュニケーションズ株式会社",
                "ファミリーエナジー合同会社",
                "みんな電力株式会社",
                "株式会社エフエネ(カルガモでんき)",
                "株式会社エフエネ(エフエネ電気)",
                "株式会社シナネン"
                ],
    "東北エリア":[
                "エバーグリーン・リテイリング株式会社",
                "ジニーエナジー合同会社",
                "東京電力エナジーパートナー株式会社(東北エリア料金)",
                "東北電力株式会社",
                "株式会社Ｆ－Ｐｏｗｅｒ(ピタでん)",
                "ＴＲＥＮＤＥ株式会社(あしたでんき)",
                "株式会社Ｌｏｏｏｐ",
                "ＴＥＰＣＯライフサービス株式会社",
                "楽天エナジー株式会社",
                "株式会社イーネットワークシステムズ(パレット電気)",
                "アンフィニ株式会社(Japan電力)",
                "ＥＮＥＯＳ株式会社（ＪＸＴＧエネルギー株式会社）",
                "ＨＴＢエナジー株式会社(東北シンプルプラン)",
                "ＨＴＢエナジー株式会社(東北レギュラープランB)",
                "ＫＤＤＩ株式会社(auでんき)",
                "ＫＤＤＩ株式会社(UQでんき)",
                "ＳＢパワー株式会社(くらしでんき)",
                "ＳＢパワー株式会社(おうちでんき)",
                "株式会社ＰｉｎＴ",
                "株式会社グランデータ(ライフでんき)",
                "株式会社グランデータ(セレクトでんき)",
                "ＭＣリテールエナジー株式会社(まちエネ)",
                "株式会社ミツウロコヴェッセル",
                "丸紅新電力株式会社",
                "株式会社エルピオ",
                "出光興産株式会社",
                "シン・エナジー株式会社",
                "株式会社ＮＥＸＴ ＯＮＥ（ラストワンマイル）",
                "株式会社サイサン(エネワンでんき)",
                "株式会社リミックスポイント",
                "ネクストエナジー・アンド・リソース株式会社(GREENaでんき)",
                "エフビットコミュニケーションズ株式会社",
                "ファミリーエナジー合同会社",
                "みんな電力株式会社",
                "株式会社エフエネ(エフエネ電気)",
                "株式会社エフエネ(カルガモでんき)",
                "J:COM株式会社",
                "株式会社シナネン",
                ],
    "九州エリア":[
              "エバーグリーン・リテイリング",
              "株式会社フラットエナジー株式会社",
              "ジニーエナジー合同会社",
              "株式会社アイ・グリッド・ソリューションズ(スマ電)",
              "九州電力株式会社",
    ]
};
// 切り替え先の電力会社を配列入れる
const areaList2 = {
  "関東エリア":[
                "エバーグリーン・リテイリング",
                "株式会社フラットエナジー株式会社",
                "ジニーエナジー合同会社",
                "株式会社東急パワーサプライ",
                "東京電力エナジーパートナー株式会社(従量電灯B)",
                "東京電力エナジーパートナー株式会社(スタンダードSプラン)",
                "東北電力株式会社（関東エリア料金）",
                "中国電力株式会社（関東エリア料金）",
                "株式会社Ｆ－Ｐｏｗｅｒ(ピタでん)",
                "ＴＲＥＮＤＥ株式会社(あしたでんき)",
                "株式会社オカモト(0円でんき)",
                "株式会社Ｌｏｏｏｐ",
                "ＴＥＰＣＯライフサービス株式会社",
                "楽天エナジー株式会社",
                "株式会社イーネットワークシステムズ(パレット電気)",
                "アンフィニ株式会社(Japan電力)",
                "ＥＮＥＯＳ株式会社（ＪＸＴＧエネルギー株式会社）",
                "ＨＴＢエナジー株式会社(シンプルプラン)",
                "ＨＴＢエナジー株式会社(東京レギュラープランB)",
                "ＫＤＤＩ株式会社(auでんき)",
                "ＫＤＤＩ株式会社(UQでんき)",
                "ＳＢパワー株式会社(おうちでんき)",
                "ＳＢパワー株式会社(くらしでんき)",
                "株式会社ＰｉｎＴ",
                "株式会社グランデータ(ライフでんき)",
                "株式会社グランデータ(セレクトでんき)",
                "東京ガス株式会社",
                "ＭＣリテールエナジー株式会社(まちエネ)",
                "株式会社ＣＤエナジーダイレクト",
                "株式会社アイ・グリッド・ソリューションズ(スマ電)",
                "株式会社ミツウロコヴェッセル",
                "丸紅新電力株式会社",
                "九電みらいエナジー株式会社",
                "株式会社エルピオ(スタンダードライト)",
                "出光興産株式会社",
                "シン・エナジー株式会社",
                "株式会社ＮＥＸＴ ＯＮＥ（ラストワンマイル）",
                "株式会社サイサン(エネワンでんき)",
                "株式会社リミックスポイント",
                "株式会社エネアーク関東",
                "ネクストエナジー・アンド・リソース株式会社(GREENaでんき)",
                "エフビットコミュニケーションズ株式会社",
                "ファミリーエナジー合同会社",
                "みんな電力株式会社",
                "生活協同組合コープみらい",
                "株式会社エフエネ(エフエネ電気)",
                "株式会社エフエネ(カルガモでんき)",
                "J:COM株式会社",
                "株式会社シナネン"
                ],
    "中部エリア":[
                "エバーグリーン・リテイリング株式会社",
                "フラットエナジー株式会社",
                "ジニーエナジー合同会社",
                "東京電力エナジーパートナー株式会社(中部エリア料金)",
                "中部電力ミライズ株式会社(おとくプラン(40A))",
                "中部電力ミライズ株式会社(ポイントプラン)",
                "株式会社Ｆ－Ｐｏｗｅｒ(ピタでん)",
                "ＴＲＥＮＤＥ株式会社(あしたでんき)",
                "株式会社オカモト(0円でんき)",
                "株式会社Ｌｏｏｏｐ",
                "ＴＥＰＣＯライフサービス株式会社",
                "楽天エナジー株式会社",
                "株式会社イーネットワークシステムズ(パレット電気)",
                "アンフィニ株式会社(Japan電力)",
                "ＥＮＥＯＳ株式会社（ＪＸＴＧエネルギー株式会社）",
                "ＨＴＢエナジー株式会社(中部シンプルプラン)",
                "ＨＴＢエナジー株式会社(中部レギュラープランB)",
                "ＫＤＤＩ株式会社(auでんき)",
                "ＫＤＤＩ株式会社(UQでんき)",
                "ＳＢパワー株式会社(おうちでんき)",
                "ＳＢパワー株式会社(くらしでんき)",
                "株式会社ＰｉｎＴ",
                "株式会社グランデータ(ライフでんき)",
                "株式会社グランデータ(セレクトでんき)",
                "東邦ガス株式会社",
                "ＭＣリテールエナジー株式会社(まちエネ)",
                "株式会社アイ・グリッド・ソリューションズ(スマ電)",
                "株式会社ミツウロコヴェッセル",
                "丸紅新電力株式会社",
                "株式会社エルピオ",
                "出光興産株式会社",
                "シン・エナジー株式会社",
                "株式会社ＮＥＸＴ ＯＮＥ（ラストワンマイル）",
                "株式会社サイサン(エネワンでんき)",
                "株式会社リミックスポイント",
                "株式会社エネアーク中部",
                "ネクストエナジー・アンド・リソース株式会社(GREENaでんき)",
                "エフビットコミュニケーションズ株式会社",
                "ファミリーエナジー合同会社",
                "みんな電力株式会社",
                "株式会社エフエネ(カルガモでんき)",
                "株式会社エフエネ(エフエネ電気)",
                "株式会社シナネン"
                ],
    "東北エリア":[
                "エバーグリーン・リテイリング株式会社",
                "ジニーエナジー合同会社",
                "東京電力エナジーパートナー株式会社(東北エリア料金)",
                "東北電力株式会社",
                "株式会社Ｆ－Ｐｏｗｅｒ(ピタでん)",
                "ＴＲＥＮＤＥ株式会社(あしたでんき)",
                "株式会社Ｌｏｏｏｐ",
                "ＴＥＰＣＯライフサービス株式会社",
                "楽天エナジー株式会社",
                "株式会社イーネットワークシステムズ(パレット電気)",
                "アンフィニ株式会社(Japan電力)",
                "ＥＮＥＯＳ株式会社（ＪＸＴＧエネルギー株式会社）",
                "ＨＴＢエナジー株式会社(東北シンプルプラン)",
                "ＨＴＢエナジー株式会社(東北レギュラープランB)",
                "ＫＤＤＩ株式会社(auでんき)",
                "ＫＤＤＩ株式会社(UQでんき)",
                "ＳＢパワー株式会社(くらしでんき)",
                "ＳＢパワー株式会社(おうちでんき)",
                "株式会社ＰｉｎＴ",
                "株式会社グランデータ(ライフでんき)",
                "株式会社グランデータ(セレクトでんき)",
                "ＭＣリテールエナジー株式会社(まちエネ)",
                "株式会社ミツウロコヴェッセル",
                "丸紅新電力株式会社",
                "株式会社エルピオ",
                "出光興産株式会社",
                "シン・エナジー株式会社",
                "株式会社ＮＥＸＴ ＯＮＥ（ラストワンマイル）",
                "株式会社サイサン(エネワンでんき)",
                "株式会社リミックスポイント",
                "ネクストエナジー・アンド・リソース株式会社(GREENaでんき)",
                "エフビットコミュニケーションズ株式会社",
                "ファミリーエナジー合同会社",
                "みんな電力株式会社",
                "株式会社エフエネ(エフエネ電気)",
                "株式会社エフエネ(カルガモでんき)",
                "J:COM株式会社",
                "株式会社シナネン",
                ],
  "九州エリア":[
              "エバーグリーン・リテイリング",
              "株式会社フラットエナジー株式会社",
              "ジニーエナジー合同会社",
              "株式会社アイ・グリッド・ソリューションズ(スマ電)",
              "九州電力株式会社",
  ]
};
// 現在の電力会社の変数
var service_list1     = document.getElementById('service_list1');
var capacity_list1    = document.getElementById('capacity_list1');
var item_Basic1       = document.getElementById('item_Basic1');
var item_first1       = document.getElementById('item_first1');
var item_second1      = document.getElementById('item_second1');
var item_third1       = document.getElementById('item_third1');
var consumption_text1 = document.getElementById('consumption_text1');
var total_item1       = document.getElementById('total_item1');
var border_text1      = document.getElementById('border_text1');
var number_text       = document.getElementById('number_text');
// 切り替え先の変数
var area_list2        = document.getElementById('area_list2');
var service_list2     = document.getElementById('service_list2');
var capacity_list2    = document.getElementById('capacity_list2');
var item_Basic2       = document.getElementById('item_Basic2');
var item_first2       = document.getElementById('item_first2');
var item_second2      = document.getElementById('item_second2');
var item_third2       = document.getElementById('item_third2');
var consumption_text2 = document.getElementById('consumption_text2');
var total_item2       = document.getElementById('total_item2');
var border_text2      = document.getElementById('border_text2');
// スマホ版の変数
var area_list3        = document.getElementById('area_list3');
var service_list3     = document.getElementById('service_list3');
var capacity_list3    = document.getElementById('capacity_list3');
var item_Basic3       = document.getElementById('item_Basic3');
var item_first3       = document.getElementById('item_first3');
var item_second3      = document.getElementById('item_second3');
var item_third3       = document.getElementById('item_third3');
var consumption_text3 = document.getElementById('consumption_text3');
var total_item3       = document.getElementById('total_item3');
var border_text3      = document.getElementById('border_text3');


// <!-- 切り替え先にエリアを反映 -->
//select要素の取得
var area_list1 = document.querySelector('#area_list1');

//変更イベントを監視
area_list1.addEventListener('change', handleChange);

function handleChange(event) {
    var value = area_list1.value;
    document.querySelector('#area_list2').innerHTML = value;
}

// スマホ版
area_list1.addEventListener('change', handleChange3);

function handleChange3(event) {
    var value = area_list1.value;
    document.querySelector('#area_list3').innerHTML = value;
}



// エリアを選択していないと電力会社を選択できない処理
function createMenu(selectArea_list1){
  let company_list1 = document.getElementById('company_list1');
  company_list1.disabled = false;
  // 使用エリアを変更した際全て空にする
  // 現電力会社
  company_list1.innerHTML = '';
  service_list1.innerHTML = '';
  capacity_list1.value = '-';
  consumption_text1.value = '';
  item_Basic1.innerHTML = '';
  item_first1.innerHTML = '';
  item_second1.innerHTML = '';
  item_third1.innerHTML = '';
  total_item1.innerHTML = '';
  border_text1.innerHTML = '';
  // number_text.innerHTML ='';
// 切り替え先
  company_list2.innerHTML = '';
  service_list2.innerHTML = '';
  capacity_list2.value = '-';
  consumption_text2.value = '';
  item_Basic2.innerHTML = '';
  item_first2.innerHTML = '';
  item_second2.innerHTML = '';
  item_third2.innerHTML = '';
  total_item2.innerHTML = '';
  border_text2.innerHTML = '';
  // スマホ版
  company_list3.innerHTML = '';
  service_list3.innerHTML = '';
  capacity_list3.value = '-';
  consumption_text3.value = '';
  item_Basic3.innerHTML = '';
  item_first3.innerHTML = '';
  item_second3.innerHTML = '';
  item_third3.innerHTML = '';
  total_item3.innerHTML = '';
  border_text3.innerHTML = '';
  let option = document.createElement('option');
  option.innerHTML = 'エリアを選択してください';
  option.defaultSelected = true;
  option.disabled = true;
  company_list1.appendChild(option);

  // エリアを参照して電力会社表示
  areaList[selectArea_list1].forEach( area => {
    let option = document.createElement('option');
    option.innerHTML = area;
    company_list1.appendChild(option);  
  });
}

// 切り替え先
function createMenu2(selectArea_list2){
  let company_list2 = document.getElementById('company_list2');
  company_list2.disabled = false;
  let option = document.createElement('option');
  option.innerHTML = 'エリアを選択してください';
  option.defaultSelected = true;
  option.disabled = true;
  company_list2.appendChild(option);

  // エリアを参照して電力会社表示
  areaList2[selectArea_list2].forEach( area2 => {
    let option = document.createElement('option');
    option.innerHTML = area2;
    company_list2.appendChild(option);  
  });

// スマホ版
}
function createMenu3(selectArea_list3){
  let company_list3 = document.getElementById('company_list3');
  company_list3.disabled = false;
  let option = document.createElement('option');
  option.innerHTML = 'エリアを選択してください';
  option.defaultSelected = true;
  option.disabled = true;
  company_list3.appendChild(option);

  // エリアを参照して電力会社表示
  areaList2[selectArea_list3].forEach( area2 => {
    let option = document.createElement('option');
    option.innerHTML = area2;
    company_list3.appendChild(option);  
  });
}
  
// 電力会社会社名の処理
  let company_list1 = document.getElementById('company_list1');
  company_list1.addEventListener('change', function(){
  let index =  company_list1.selectedIndex;
  item_Basic1.innerHTML = '';
  consumption_text1.value = '';
  capacity_list1.value = '-';
  total_item1.innerHTML = '';
  border_text1.innerHTML ='';
  border_text2.innerHTML ='';

  // エリアごとに電力会社名の中身を変える処理
  if(area_list1.value == "関東エリア")　{
    companyData = [
      ['エバーグリーンでんき','1から始まる8桁の番号', 554.84, 832.26, 1109.68, 1387.10, 1664.52, 19.28,25.69,29.65],
      ['ふらっとでんき','フリーダイヤルかお問い合わせフォームで確認', 0, 0, 0, 0, 0, 26.3, 26.3, 26.3],
      ['ジニーエナジー','401000＋5桁の番号',253,	429,	506,	632.5,	759,	24,	24,	24],
      ['東急でんき','3か2から始まる10桁の番号',"無し",	803,	1089,	1320,	1551,	19.77,	26.36,	29.57],
      ['TEPCO(従量電灯B)', '10桁か13桁　※18桁の時は最初の5桁を含めない', 572,	858,	1144,	1430,	1716.00,	19.88,	26.48,	30.57],
      ['TEPCO(スタンダードSプラン)', '10桁か13桁　※18桁の時は最初の5桁を含めない',	572,	858,	1144,	1430,	1716,	19.88,	26.46	,30.57],
      ['東北電力' ,'17桁　※検針票によっては18桁あるため最初の17桁(最後の桁は副列まで)', '無し',	858,	1144,	1430,	1716,	19.87,	24.94,	29.5],
      ['中国電力', '',	0,	0,	0,	0,	0,	25.78,	25.78,	25.78],
      ['ピタでん', '10桁から始まる番号',	0,	0,	0,	0,	0,	25.71,	25.71,	25.71],
      ['あしたでんき', '7桁？',	0,	0,	0,	0,	0,	26,	26,	26],
      ['0円でんき', '統一されていない',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['Looopでんき', '"Looop＋15桁の番号←はマイページから確認　※名義は請求書の方を確認※両方確認できるのがお申込み時に届いている【Looopでんき】お申込みメールアドレスのご確認という内容のメール←地点番号の記載はなし"',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['ゼロからでんき', '統一されていない',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['楽天でんき', '80＋8桁の番号',	0,	0,	0,	0,	0, 26.5,	26.5,	26.5],
      ['パレット電気', '2020＋11桁の番号',	0,	0,	0,	0,	0, 27.2,	26.46,	27.77],
      ['Japan電力', '契約完了メールで確認',	0,	0,	0,	0,	0, 26,	25.5,	24.5],
      ['ENEOSでんき', '契約番号(6桁か7桁)',	572,	858,	1144,	1430,	1716,	19.88,	24.54,	26.22],
      ['ニチデン', 'C＋9桁の番号　※まるっとでんきのお客様番号は電話確認しないとお客様番号は照会できない',	554.84,	832.26,	1109.68,	1387.1,	1664.52,	24.44,	25.16,	23.43],
      ['ニチデン', 'C＋9桁の番号　※まるっとでんきのお客様番号は電話確認しないとお客様番号は照会できない',	543.4,	815.1,	1086.8,	1358.5,	1630.2,	25.77,	25.16,	23.43],
      ['auでんき', '９から始まる10桁の番号　※契約開始日によって供給元とお客様番号が違うため地域電力の場合は別のお客様番号確認',	572,	858,	1144,	1430,	1716,	19.87,	26.47,	30.56],
      ['UQでんき', '９から始まる10桁の番号　※契約開始日によって供給元とお客様番号が違うため地域電力の場合は別のお客様番号確認',	572,	858,	1144,	1430,	1716,	19.87,	26.47,	30.56],
      ['ソフトバンクでんき', '0から始まる11桁の番号',	572,	858,	1144,	1430,	1716,	19.68,	26.21,	30.26],
      ['ソフトバンクでんき', '0から始まる11桁の番号',	572,	858,	1144,	1430,	1716,	19.68,	25.68,	29.04],
      ['PinTでんき', 'アカウントIDと一緒',	572,	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
      ['ライフでんき', '',	514.8,	772.2,	1029.6,	1287,	1544.4,	25.20, 25.20, 	25.20],
      ['セレクトでんき', '',514.8,	772.20,	1029.6,	1287,	1544.4,	25.20,	25.20, 	25.20],
      ['東京ガス', '11桁の番号　※電気とガスのお客様番号は一緒',1572,	858,	1144,	1430,	1716,	23.67,	23.88,	26.41],
      ['まちエネ', '0から始まる番号　※契約番号ではなくお客様番号',	572,	858,	1144,	1430,	1716,	19.79,	25.27,	26.47],
      ['CDエナジー', '910＋6桁の番号',	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
      ['スマ電' , '1000＋6桁の番号','なし', 858,	894,	930,	1216,	19.76,	25.87,	25.97],
      ['ミツウロコ', '2から始まる11桁の番号　※小売電気事業者名要確認',	572,	858,	1144,	1430,	1716,	21.83,	23.05,	25.71],
      ['丸紅電気', '',	803,	803,	1089,	1375,	1661,	19.78,	26.38,	26.38],
      ['九電みらいエナジー', '９から始まる番号',	529.62,	794.43,	1059.24,	1324.05,	1588.86,	19.76,	25.67,	28.01],
      ['エルピオ電気', '', '無し',858.00,'無し','無し','無し',21.14,	23.03,	25.78],
      ['出光昭和シェル', 'C＋9桁の番号',	572,	858,	1144,	1430,	1716,	19.88,	24.44,	26.18],
      ['シン・エナジー', '１または２から始まる7桁の番号', '無し',	768.34,	1024.45,	1280.56,	1536.68,	19.67,	24.78,	27.71],
      ['まるっとでんき', 'C＋9桁の番号　※まるっとでんきのお客様番号は電話確認しないとお客様番号は照会できない',	554.84,	832.26,	1109.68,	1387.10,	1664.52,	24.97,	24.97,	24.97],
      ['エネワンでんき','12桁の番号','無し',	825,	1100,	1375,	1650,	19.88,	26.48,	26.91],
      ['リミックスでんき','PPから始まる番号','無し',		815.1,	1086.8,	1358.5,	1630.2,	18.88,	25.15,	29.04],
      ['エネアーク関東','統一されていない','無し',	840.84,	1094.81,	1365.65,	1630.2,	19.49,	25.96,	29.96],
      ['GREENaでんき','5桁＋アルファベット＋6桁の番号',	858,	858,	1144,	1430,	1716,	19.88,	26.48,	30.58],
      ['エフビットでんき', '統一されていない','無し',		815.1,	1086.8,	1358.5,	1630.2,	19.48,	25.15,	28.43],
      ['ファミリーエナジー','10桁？',	286,	429,	572,	715,	858,	26.92,	26.92,	26.92],
      ['みんな電力', '10桁？'	,786,	929,	1072,	1215,	1358,	24.99,	24.99,	24.99],
      ['コープデリでんき','8桁の番号',	572,	858,	1144,	1430,	1716,	19.65,	24.44,	25.91],
      ['エフエネ電気','','無し', 	858,	1144,	1430,	1716,	20.08,	25.71,	28.28],
      ['カルガモでんき','',	514.8,	772.2,	1029.6,	1287,	1544.4,	25.71,	25.71,	28.28],
      ['J:COM電力','',	572,	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
      ['シナネン電気','',	572,	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
    ];
  }else if(area_list1.value == "中部エリア") {
    companyData = [
      ['エバーグリーンでんき','1から始まる8桁の番号', 554.84,	832.26,	1109.68,	1387.10,	1664.52,	19.28,	25.69,	29.65],
      ['ふらっとでんき','不明', 0, 0, 0, 0, 0, 26.3, 26.3, 26.3],
      ['ジニーエナジー','401000＋5桁の番号',253.00,	379.05,	506.00,	632.50,	759.00,	24.50,	24.50,	24.50],
      ['TEPCO(スタンダードSプラン)', '10桁か13桁　※18桁の時は最初の5桁を含めない', 572,	858,	1144,	1430,	1716,	21.03,	24.18,	27.52],
      ['ミライズ', '', '無し','無し',	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ['ミライズ', '', 572,	858,	'無し',	'無し',	'無し',	21.04,	25.51,	28.46],
      ['ピタでん', '10桁から始まる番号',	0,	0,	0,	0,	0,	25.71,	25.71,	25.71],
      ['あしたでんき', '7桁？',	0,	0,	0,	0,	0,	26,	26,	26],
      ['0円でんき', '統一されていない',	0,	0,	0,	0,	0, 26.3,	26.3,	26.3],
      ['Looopでんき', '"Looop＋15桁の番号←はマイページから確認　※名義は請求書の方を確認※両方確認できるのがお申込み時に届いている【Looopでんき】お申込みメールアドレスのご確認という内容のメール←地点番号の記載はなし"',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['ゼロからでんき', '統一されていない',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['楽天でんき', '80＋8桁の番号',	0,	0,	0,	0,	0, 26.5,	26.5,	26.5],
      ['パレット電気', '2020＋11桁の番号',	0,	0,	0,	0,	0, 28.17,	25.51,	25.80],
      ['Japan電力', '契約完了メールで確認',	0,	0,	0,	0,	0, 26,	25.5,	24.5],
      ['ENEOSでんき', '契約番号(6桁か7桁)',	572,	858,	1144,	1430,	1716,	20.85,	24.77,	26.49],
      ['ニチデン', 'C＋9桁の番号　※まるっとでんきのお客様番号は電話確認しないとお客様番号は照会できない',	554.84,	832.26,	1109.68,	1387.1,	1664.52,	24.44,	24.44,	24.44],
      ['ニチデン', 'C＋9桁の番号　※まるっとでんきのお客様番号は電話確認しないとお客様番号は照会できない',	563.77,	815.1,	1086.8,	1358.5,	1630.2,	25.77,	25.16,	23.84],
      ['auでんき', '９から始まる10桁の番号　※契約開始日によって供給元とお客様番号が違うため地域電力の場合は別のお客様番号確認',	572,	858,	1144,	1430,	1716,	21.03,	25.50,	28.45],
      ['UQでんき', '９から始まる10桁の番号　※契約開始日によって供給元とお客様番号が違うため地域電力の場合は別のお客様番号確認',	572,	858,	1144,	1430,	1716,	21.03,	25.50,	28.45],
      ['ソフトバンクでんき', '0から始まる11桁の番号',	572,	858,	1144,	1430,	1716,	20.82,	25.25,	28.17],
      ['ソフトバンクでんき', '0から始まる11桁の番号',	572,	858,	1144,	1430,	1716,	20.82,	24.74,	27.03],
      ['PinTでんき', 'アカウントIDと一緒',	572,	858,	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ['ライフでんき', '',	514.8,	772.2,	1029.6,	1287,	1544.4,	24.80,	24.80,	24.80],
      ['セレクトでんき', '',514.8,	772.20,	1029.6,	1287,	1544.4,	24.80,	24.80,	24.80],
      ['東邦ガス', '',547,	833,	991,	1277,	1563,	21.02,	25.16,	25.18],
      ['まちエネ', '0から始まる番号　※契約番号ではなくお客様番号',	572,	858,	1144,	1430,	1716,	20.97,	24.37,	24.67],
      ['スマ電' , '1000＋6桁の番号','無し', 558,	844,	1130,	1416,	20.95,	25.13,	26.76],
      ['ミツウロコ', '2から始まる11桁の番号　※小売電気事業者名要確認',	572,	858,	1144,	1430,	1716,	23.10,	23.40,	25.99],
      ['丸紅電気', '',	1089,	1089,	1089,	1375,	1661,	21.02,	25.49,	26.15],
      ['エルピオ電気', '','無し',	743.52,	937.04,	1171.29,	1497.22,	23.62,	23.62,	23.62],
      ['出光昭和シェル', 'C＋9桁の番号',	572,	858,	1144,	1430,	1716,	21.04,	24.93,	26.29],
      ['シン・エナジー', '１または２から始まる7桁の番号', '無し',	824.95,	1101.59,	1375.25,	1649.91,	20.40,	23.87,	25.24],
      ['まるっとでんき', 'C＋9桁の番号　※まるっとでんきのお客様番号は電話確認しないとお客様番号は照会できない',	554.84,	832.26,	1109.68,	1387.10,	1664.52,	25.99,	25.99,	25.99],
      ['エネワンでんき','12桁の番号','無し',	825,	1100,	1375,	1650,	21.04,	23.98,	25.33],
      ['リミックスでんき','PPから始まる番号','無し',		815.1,	1086.8,	1358.5,	1630.2,	19.98,	24.23,	27.03],
      ['エネアーク中部','統一されていない','無し',	766.35,	1021.8,	1277.25,	1532.7,	21.06,	25.30,	26.21],
      ['GREENaでんき','5桁＋アルファベット＋6桁の番号',	858,	858,	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ['エフビットでんき', '統一されていない','無し',		815.1,	1086.8,	1358.5,	1630.2,	20.61,	24.23,	26.46],
      ['ファミリーエナジー','10桁？',253,	379.5,	506,	632.5,	759,	29.65,	29.65,	29.65],
      ['みんな電力', '10桁？'	,753,	879.5,	1006,	1132.5,	1259,	25.71,	25.71,	25.71],
      ['カルガモでんき','',	514.8,	772.2,	1029.6,	1287,	1544.4,	24.78,	24.78,	24.78],
      ['エフエネ電気','','無し', 	858,	1144,	1430,	1716,	21.26,	24.78,	26.62],
      ['シナネン電気','',	572,	858,	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ];
  }else if(area_list1.value == "東北エリア") {
    companyData = [
      ['エバーグリーンでんき','1から始まる8桁の番号','無し',	960.30,	1280.40,	1600.50,	1920.60,	18.02,	24.57,	28.40],
      ['ジニーエナジー','401000＋5桁の番号',253,	379.05,	506,	632.5,	759,	23.50,	23.50,	23.50],
       ['TEPCO(スタンダードSプラン)', '10桁か13桁　※18桁の時は最初の5桁を含めない',	660,	990,	1320,	1650,	1980,	18.55,	24.06,	28.41],
      ['東北電力' ,'17桁　※検針票によっては18桁あるため最初の17桁(最後の桁は副列まで)', '無し',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['ピタでん', '10桁から始まる番号',	0,	0,	0,	0,	0,	25.71,	25.71,	25.71],
      ['あしたでんき', '7桁？',	0,	0,	0,	0,	0,	26,	26,	26],
      ['Looopでんき', '"Looop＋15桁の番号←はマイページから確認　※名義は請求書の方を確認※両方確認できるのがお申込み時に届いている【Looopでんき】お申込みメールアドレスのご確認という内容のメール←地点番号の記載はなし"',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['ゼロからでんき', '統一されていない',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['楽天でんき', '80＋8桁の番号',	0,	0,	0,	0,	0, 26.5,	26.5,	26.5],
      ['パレット電気', '2020＋11桁の番号',	0,	0,	0,	0,	0, 26.82,	26.46,	26.57],
      ['Japan電力', '契約完了メールで確認',	0,	0,	0,	0,	0, 26,	25.33,	24.50],
      ['ENEOSでんき', '契約番号(6桁か7桁)',	660,	990,	1320,	1650,	1980,	18.38,	24.54,	26.22],
      ['ニチデン', 'C＋9桁の番号　※まるっとでんきのお客様番号は電話確認しないとお客様番号は照会できない',	640.2,	960.3,	1280.4,	1600.5,	1920.6,	23.43,	23.43,	23.43],
      ['ニチデン', 'C＋9桁の番号　※まるっとでんきのお客様番号は電話確認しないとお客様番号は照会できない',	627,	940.5,	1254,	1567.5,	1881,	24.96,	24.34,	23.12],
      ['auでんき', '９から始まる10桁の番号　※契約開始日によって供給元とお客様番号が違うため地域電力の場合は別のお客様番号確認',660, 990,	1320,	1650,	1980,	18.56,	25.32,	29.27],
      ['UQでんき', '９から始まる10桁の番号　※契約開始日によって供給元とお客様番号が違うため地域電力の場合は別のお客様番号確認',	660, 990,	1320,	1650,	1980,	18.56,	25.32,	29.27],
      ['ソフトバンクでんき', '0から始まる11桁の番号',	660,	990,	1320,	1650,	1,980,	19.68,	25.68,	29.04],
      ['ソフトバンクでんき', '0から始まる11桁の番号',660,	990,	1320,	1650,	1980,	19.68,	26.21,	30.26],
      ['PinTでんき', 'アカウントIDと一緒',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['ライフでんき', '',	594,	891.2,	1188,	1485,	1782,	24.20,	24.20,	24.20],
      ['セレクトでんき', '',594,	891.2,	1188,	1485,	1782,	24.20,	24.20,	24.20],
      ['まちエネ', '0から始まる番号　※契約番号ではなくお客様番号',	660,	990,	1320,	1,650,	1,980,	18.50,	24.17,	25.35],
      ['ミツウロコ', '2から始まる11桁の番号　※小売電気事業者名要確認',	660,	990,	1320,	1650,	1980,	20.61,	23.22,	26.80],
      ['丸紅電気', '',	935,	935,	1265,	1595,	1925,	18.57,	25.33,	26.8],
      ['エルピオ電気', '', '無し',743.52,	937.04,	1171.29,	1497.22,	23.42,	23.42,	23.42],
      ['出光昭和シェル', 'C＋9桁の番号',	660,	990,	1320,	1650,	1980,	18.58,	24.65,	26.88],
      ['シン・エナジー', '１または２から始まる7桁の番号', '無し',	980.83,	1307.78,	1633.7,	1960.65,	18.31,	24.42,	26.79],
      ['まるっとでんき', 'C＋9桁の番号　※まるっとでんきのお客様番号は電話確認しないとお客様番号は照会できない',	640.2,	960.3,	1280.4,	1600.5,	1920.6,	24.94,	24.94,	24.94],
      ['エネワンでんき','12桁の番号','無し',	957,	1276,	1595,	1914,	18.58,	25.33,	26.94],
      ['リミックスでんき','PPから始まる番号','無し',	940.5,	1254,	1567.5,	1881,	17.65,	24.06,	27.82],
      ['GREENaでんき','5桁＋アルファベット＋6桁の番号',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['エフビットでんき', '統一されていない','無し',		940.5,	1254,	1567.5,	1881,	18.20,	24.06,	27.23],
      ['ファミリーエナジー','10桁？',	253,	379.05,	506,	632.5,	759,	30.55,	30.55,	30.55],
      ['みんな電力', '10桁？'	,753,	929,	1006,	1132.5,	1259,	24.99,	24.99,	24.99],
      ['エフエネ電気','','無し', 	990,	1320,	1650,	1980,	20.08,	25.71,	28.28],
      ['カルガモでんき','',	594,	772.2,	1188,	1485,	1782,	25.71,	25.71,	25.71],
      ['J:COM電力','',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['シナネン電気','',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ]
  }else if(area_list1.value == "九州エリア") {
    companyData = [
      ['エバーグリーンでんき','なし', 864.27, 1152.36, 1440.45, 1728.54, 16.94,22.37,25.28],
      ['ふらっとでんき', 0, 0, 0, 0, 0, 23.3, 23.3, 23.3],
      ['ジニーエナジー',253.00,	429.00,	506.00,	632.50,	759.00,	21.5,	21.5,	21.5],
      ['スマ電' ,594, 741,	1038,	1335,	1632,	17.46,	23.06,	26.06],
      ['スマートファミリープラン','',594,891,1188,1485,1782,17.46,23.06,24.96],
    ]
  }
  // アンペア数ごとに基本料金を変更する処理
let kanto_area = companyData[index - 1];
service_list1.textContent = kanto_area[0];
// number_text.textContent   = kanto_area[0] + ':' + kanto_area[1];
item_first1.textContent   = kanto_area[7];
item_second1.textContent  = kanto_area[8];
item_third1.textContent   = kanto_area[9];
function capacityChange(event){
  let capacity_value = event.currentTarget.value
  if(capacity_value == "20A") {
  var basic = item_Basic1.textContent = kanto_area[2];
  } else if (capacity_value == "30A") {
   var basic =item_Basic1.textContent = kanto_area[3];
  } else if (capacity_value == "40A") {
   var basic =item_Basic1.textContent = kanto_area[4];
  } else if (capacity_value == "50A") {
   var basic =item_Basic1.textContent = kanto_area[5];
  } else if (capacity_value == "60A") {
   var basic =item_Basic1.textContent = kanto_area[6];
  }
  consumption_text1.value = '';
  total_item1.innerHTML = '';


// 使用量が入力されたときに電力料金が表示される処理
consumption_text1.addEventListener('input',handleInput)
 function handleInput(event){

if(event.target.value < 120){
  company_price = basic + kanto_area[7]* parseInt(event.target.value)
  total_item1.textContent = Math.round(company_price * 100) / 100;
} else if(event.target.value<300){
  company_price = basic +120*kanto_area[7]+kanto_area[8]*(event.target.value-120)
  total_item1.textContent = Math.round(company_price * 100) / 100;
} else if(event.target.value>=300) {
  company_price = basic +120*kanto_area[7]+180*kanto_area[8]+kanto_area[9]*(event.target.value-300)
  total_item1.textContent = Math.round(company_price *100 ) / 100;
}
}
}
let capacity = document.getElementById('capacity_list1');
capacity.addEventListener('change', capacityChange);
});


// 切り替え先の処理
  let company_list2= document.getElementById('company_list2');
  company_list2.addEventListener('change', function(){
  let index =  company_list2.selectedIndex;
  item_Basic2.innerHTML = '';
  consumption_text2.value = '';
  capacity_list2.value = '-';
  total_item2.innerHTML = '';
  border_text1.innerHTML ='';
  border_text2.innerHTML ='';
  
  if(area_list1.value == "関東エリア")　{
    companyData = [
      ['エバーグリーンでんき', 554.84, 832.26, 1109.68, 1387.10, 1664.52, 19.28,25.69,29.65],
      ['ふらっとでんき', 0, 0, 0, 0, 0, 26.3, 26.3, 26.3],
      ['ジニーエナジー',253,	429,	506,	632.5,	759,	24,	24,	24],
      ['東急でんき',"無し",	803,	1089,	1320,	1551,	19.77,	26.36,	29.57],
      ['TEPCO(従量電灯B)', 572,	858,	1144,	1430,	1716.00,	19.88,	26.48,	30.57],
      ['TEPCO(スタンダードSプラン)',	572,	858,	1144,	1430,	1716,	19.88,	26.46	,30.57],
      ['東北電力' , '無し',	858,	1144,	1430,	1716,	19.87,	24.94,	29.5],
      ['中国電力',	0,	0,	0,	0,	0,	25.78,	25.78,	25.78],
      ['ピタでん',	0,	0,	0,	0,	0,	25.71,	25.71,	25.71],
      ['あしたでんき',	0,	0,	0,	0,	0,	26,	26,	26],
      ['0円でんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['Looopでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['ゼロからでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['楽天でんき',	0,	0,	0,	0,	0, 26.5,	26.5,	26.5],
      ['パレット電気',	0,	0,	0,	0,	0, 27.2,	26.46,	27.77],
      ['Japan電力',	0,	0,	0,	0,	0, 26,	25.5,	24.5],
      ['ENEOSでんき',	572,	858,	1144,	1430,	1716,	19.88,	24.54,	26.22],
      ['ニチデン',	554.84,	832.26,	1109.68,	1387.1,	1664.52,	24.44,	25.16,	23.43],
      ['ニチデン',	543.4,	815.1,	1086.8,	1358.5,	1630.2,	25.77,	25.16,	23.43],
      ['auでんき',	572,	858,	1144,	1430,	1716,	19.87,	26.47,	30.56],
      ['UQでんき',	572,	858,	1144,	1430,	1716,	19.87,	26.47,	30.56],
      ['ソフトバンクでんき',	572,	858,	1144,	1430,	1716,	19.68,	26.21,	30.26],
      ['ソフトバンクでんき',	572,	858,	1144,	1430,	1716,	19.68,	25.68,	29.04],
      ['PinTでんき',	572,	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
      ['ライフでんき',	514.8,	772.2,	1029.6,	1287,	1544.4,	25.20, 25.20, 	25.20],
      ['セレクトでんき',514.8,	772.20,	1029.6,	1287,	1544.4,	25.20,	25.20, 	25.20],
      ['東京ガス',1572,	858,	1144,	1430,	1716,	23.67,	23.88,	26.41],
      ['まちエネ',	572,	858,	1144,	1430,	1716,	19.79,	25.27,	26.47],
      ['CDエナジー',	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
      ['スマ電' ,'なし', 858,	894,	930,	1216,	19.76,	25.87,	25.97],
      ['ミツウロコ',	572,	858,	1144,	1430,	1716,	21.83,	23.05,	25.71],
      ['丸紅電気',	803,	803,	1089,	1375,	1661,	19.78,	26.38,	26.38],
      ['九電みらいエナジー',	529.62,	794.43,	1059.24,	1324.05,	1588.86,	19.76,	25.67,	28.01],
      ['エルピオ電気', '無し',858.00,'無し','無し','無し',21.14,	23.03,	25.78],
      ['出光昭和シェル',	572,	858,	1144,	1430,	1716,	19.88,	24.44,	26.18],
      ['シン・エナジー', '無し',	768.34,	1024.45,	1280.56,	1536.68,	19.67,	24.78,	27.71],
      ['まるっとでんき',	554.84,	832.26,	1109.68,	1387.10,	1664.52,	24.97,	24.97,	24.97],
      ['エネワンでんき','無し',	825,	1100,	1375,	1650,	19.88,	26.48,	26.91],
      ['リミックスでんき','無し',		815.1,	1086.8,	1358.5,	1630.2,	18.88,	25.15,	29.04],
      ['エネアーク関東','無し',	840.84,	1094.81,	1365.65,	1630.2,	19.49,	25.96,	29.96],
      ['GREENaでんき',	858,	858,	1144,	1430,	1716,	19.88,	26.48,	30.58],
      ['エフビットでんき','無し',		815.1,	1086.8,	1358.5,	1630.2,	19.48,	25.15,	28.43],
      ['ファミリーエナジー',	286,	429,	572,	715,	858,	26.92,	26.92,	26.92],
      ['みんな電力'	,786,	929,	1072,	1215,	1358,	24.99,	24.99,	24.99],
      ['コープデリでんき',	572,	858,	1144,	1430,	1716,	19.65,	24.44,	25.91],
      ['エフエネ電気','無し', 	858,	1144,	1430,	1716,	20.08,	25.71,	28.28],
      ['カルガモでんき',	514.8,	772.2,	1029.6,	1287,	1544.4,	25.71,	25.71,	28.28],
      ['J:COM電力',	572,	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
      ['シナネン電気',	572,	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
    ];
  }else if(area_list1.value == "中部エリア") {
    companyData = [
      ['エバーグリーンでんき', 554.84,	832.26,	1109.68,	1387.10,	1664.52,	19.28,	25.69,	29.65],
      ['ふらっとでんき', 0, 0, 0, 0, 0, 26.3, 26.3, 26.3],
      ['ジニーエナジー',253.00,	379.05,	506.00,	632.50,	759.00,	24.50,	24.50,	24.50],
      ['TEPCO(スタンダードSプラン)', 572,	858,	1144,	1430,	1716,	21.03,	24.18,	27.52],
      ['ミライズ', '無し','無し',	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ['ミライズ', 572,	858,	'無し',	'無し',	'無し',	21.04,	25.51,	28.46],
      ['ピタでん',	0,	0,	0,	0,	0,	25.71,	25.71,	25.71],
      ['あしたでんき',	0,	0,	0,	0,	0,	26,	26,	26],
      ['0円でんき',	0,	0,	0,	0,	0, 26.3,	26.3,	26.3],
      ['Looopでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['ゼロからでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['楽天でんき',	0,	0,	0,	0,	0, 26.5,	26.5,	26.5],
      ['パレット電気',	0,	0,	0,	0,	0, 28.17,	25.51,	25.80],
      ['Japan電力',	0,	0,	0,	0,	0, 26,	25.5,	24.5],
      ['ENEOSでんき',	572,	858,	1144,	1430,	1716,	20.85,	24.77,	26.49],
      ['ニチデン',	554.84,	832.26,	1109.68,	1387.1,	1664.52,	24.44,	24.44,	24.44],
      ['ニチデン',	563.77,	815.1,	1086.8,	1358.5,	1630.2,	25.77,	25.16,	23.84],
      ['auでんき',	572,	858,	1144,	1430,	1716,	21.03,	25.50,	28.45],
      ['UQでんき',	572,	858,	1144,	1430,	1716,	21.03,	25.50,	28.45],
      ['ソフトバンクでんき',	572,	858,	1144,	1430,	1716,	20.82,	25.25,	28.17],
      ['ソフトバンクでんき',	572,	858,	1144,	1430,	1716,	20.82,	24.74,	27.03],
      ['PinTでんき',	572,	858,	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ['ライフでんき',	514.8,	772.2,	1029.6,	1287,	1544.4,	24.80,	24.80,	24.80],
      ['セレクトでんき',514.8,	772.20,	1029.6,	1287,	1544.4,	24.80,	24.80,	24.80],
      ['東邦ガス',547,	833,	991,	1277,	1563,	21.02,	25.16,	25.18],
      ['まちエネ',	572,	858,	1144,	1430,	1716,	20.97,	24.37,	24.67],
      ['スマ電' ,'無し', 558,	844,	1130,	1416,	20.95,	25.13,	26.76],
      ['ミツウロコ',	572,	858,	1144,	1430,	1716,	23.10,	23.40,	25.99],
      ['丸紅電気',	1089,	1089,	1089,	1375,	1661,	21.02,	25.49,	26.15],
      ['エルピオ電気','無し',	743.52,	937.04,	1171.29,	1497.22,	23.62,	23.62,	23.62],
      ['出光昭和シェル',	572,	858,	1144,	1430,	1716,	21.04,	24.93,	26.29],
      ['シン・エナジー', '無し',	824.95,	1101.59,	1375.25,	1649.91,	20.40,	23.87,	25.24],
      ['まるっとでんき',	554.84,	832.26,	1109.68,	1387.10,	1664.52,	25.99,	25.99,	25.99],
      ['エネワンでんき','無し',	825,	1100,	1375,	1650,	21.04,	23.98,	25.33],
      ['リミックスでんき','無し',		815.1,	1086.8,	1358.5,	1630.2,	19.98,	24.23,	27.03],
      ['エネアーク中部','無し',	766.35,	1021.8,	1277.25,	1532.7,	21.06,	25.30,	26.21],
      ['GREENaでんき',	858,	858,	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ['エフビットでんき','無し',		815.1,	1086.8,	1358.5,	1630.2,	20.61,	24.23,	26.46],
      ['ファミリーエナジー',253,	379.5,	506,	632.5,	759,	29.65,	29.65,	29.65],
      ['みんな電力'	,753,	879.5,	1006,	1132.5,	1259,	25.71,	25.71,	25.71],
      ['カルガモでんき',	514.8,	772.2,	1029.6,	1287,	1544.4,	24.78,	24.78,	24.78],
      ['エフエネ電気','無し', 	858,	1144,	1430,	1716,	21.26,	24.78,	26.62],
      ['シナネン電気',	572,	858,	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ];
  }else if(area_list1.value == "東北エリア") {
    companyData = [
      ['エバーグリーンでんき','無し',	960.30,	1280.40,	1600.50,	1920.60,	18.02,	24.57,	28.40],
      ['ジニーエナジー',253,	379.05,	506,	632.5,	759,	23.50,	23.50,	23.50],
       ['TEPCO(スタンダードSプラン)',	660,	990,	1320,	1650,	1980,	18.55,	24.06,	28.41],
      ['東北電力', '無し',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['ピタでん',	0,	0,	0,	0,	0,	25.71,	25.71,	25.71],
      ['あしたでんき',	0,	0,	0,	0,	0,	26,	26,	26],
      ['Looopでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['ゼロからでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['楽天でんき',	0,	0,	0,	0,	0, 26.5,	26.5,	26.5],
      ['パレット電気',	0,	0,	0,	0,	0, 26.82,	26.46,	26.57],
      ['Japan電力',	0,	0,	0,	0,	0, 26,	25.33,	24.50],
      ['ENEOSでんき',	660,	990,	1320,	1650,	1980,	18.38,	24.54,	26.22],
      ['ニチデン',	640.2,	960.3,	1280.4,	1600.5,	1920.6,	23.43,	23.43,	23.43],
      ['ニチデン',	627,	940.5,	1254,	1567.5,	1881,	24.96,	24.34,	23.12],
      ['auでんき',660, 990,	1320,	1650,	1980,	18.56,	25.32,	29.27],
      ['UQでんき',	660, 990,	1320,	1650,	1980,	18.56,	25.32,	29.27],
      ['ソフトバンクでんき',	660,	990,	1320,	1650,	1,980,	19.68,	25.68,	29.04],
      ['ソフトバンクでんき',660,	990,	1320,	1650,	1980,	19.68,	26.21,	30.26],
      ['PinTでんき',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['ライフでんき',	594,	891.2,	1188,	1485,	1782,	24.20,	24.20,	24.20],
      ['セレクトでんき',594,	891.2,	1188,	1485,	1782,	24.20,	24.20,	24.20],
      ['まちエネ',	660,	990,	1320,	1,650,	1,980,	18.50,	24.17,	25.35],
      ['ミツウロコ',	660,	990,	1320,	1650,	1980,	20.61,	23.22,	26.80],
      ['丸紅電気',	935,	935,	1265,	1595,	1925,	18.57,	25.33,	26.8],
      ['エルピオ電気', '無し',743.52,	937.04,	1171.29,	1497.22,	23.42,	23.42,	23.42],
      ['出光昭和シェル',	660,	990,	1320,	1650,	1980,	18.58,	24.65,	26.88],
      ['シン・エナジー', '無し',	980.83,	1307.78,	1633.7,	1960.65,	18.31,	24.42,	26.79],
      ['まるっとでんき',	640.2,	960.3,	1280.4,	1600.5,	1920.6,	24.94,	24.94,	24.94],
      ['エネワンでんき','無し',	957,	1276,	1595,	1914,	18.58,	25.33,	26.94],
      ['リミックスでんき','無し',	940.5,	1254,	1567.5,	1881,	17.65,	24.06,	27.82],
      ['GREENaでんき',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['エフビットでんき','無し',		940.5,	1254,	1567.5,	1881,	18.20,	24.06,	27.23],
      ['ファミリーエナジー',	253,	379.05,	506,	632.5,	759,	30.55,	30.55,	30.55],
      ['みんな電力'	,753,	929,	1006,	1132.5,	1259,	24.99,	24.99,	24.99],
      ['エフエネ電気','無し', 	990,	1320,	1650,	1980,	20.08,	25.71,	28.28],
      ['カルガモでんき',	594,	772.2,	1188,	1485,	1782,	25.71,	25.71,	25.71],
      ['J:COM電力',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['シナネン電気',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ]
  }else if(area_list1.value == "九州エリア") {
    companyData = [
      ['エバーグリーンでんき','なし', 864.27, 1152.36, 1440.45, 1728.54, 16.94,22.37,25.28],
      ['ふらっとでんき', 0, 0, 0, 0, 0, 23.3, 23.3, 23.3],
      ['ジニーエナジー',253.00,	429.00,	506.00,	632.50,	759.00,	21.5,	21.5,	21.5],
      ['スマ電' ,594, 741,	1038,	1335,	1632,	17.46,	23.06,	26.06],
      ['スマートファミリープラン','',594,891,1188,1485,1782,17.46,23.06,24.96],
      ]
  }


  // 切り替え先のアンペア数ごとに基本料金を変更する処理
let kanto_area = companyData[index - 1];
service_list2.textContent = kanto_area[0];
item_first2.textContent = kanto_area[6];
item_second2.textContent = kanto_area[7];
item_third2.textContent = kanto_area[8];

function capacityChange2(event){
  let capacity_value = event.currentTarget.value
  if(capacity_value == "20A") {
  var basic2 = item_Basic2.textContent = kanto_area[1];
  } else if (capacity_value == "30A") {
  var basic2 = item_Basic2.textContent = kanto_area[2];
  } else if (capacity_value == "40A") {
  var basic2 = item_Basic2.textContent = kanto_area[3];
  } else if (capacity_value == "50A") {
  var basic2 = item_Basic2.textContent = kanto_area[4];
  } else if (capacity_value == "60A") {
  var basic2 = item_Basic2.textContent = kanto_area[5];
  }
  consumption_text2.value = '';
  total_item2.innerHTML = '';

// 切り替え先の使用量が入力されたときに電力料金が表示される処理
 consumption_text2.addEventListener('input',handleInput2)
 function handleInput2(event) {
if(event.target.value < 120){
  company_price = basic2 + kanto_area[6]* parseInt(event.target.value)
  total_item2.textContent = Math.round(company_price * 100) / 100;
} else if(event.target.value<300){
  company_price = basic2 +120*kanto_area[6]+kanto_area[7]*(event.target.value-120)
  total_item2.textContent = Math.round(company_price * 100) / 100;
} else if(event.target.value>=300) {
  company_price = basic2 +120*kanto_area[6]+180*kanto_area[7]+kanto_area[8]*(event.target.value-300)
  total_item2.textContent = Math.round(company_price *100 ) / 100;
}
}
}

let capacity = document.getElementById('capacity_list2');
capacity.addEventListener('change', capacityChange2);
});

// スマホ版の処理
  let company_list3= document.getElementById('company_list3');
  company_list3.addEventListener('change', function(){
  let index =  company_list3.selectedIndex;
  item_Basic3.innerHTML = '';
  consumption_text3.value = '';
  capacity_list3.value = '-';
  total_item3.innerHTML = '';
  border_text1.innerHTML ='';
  border_text2.innerHTML ='';

  if(area_list1.value == "関東エリア")　{
    companyData = [
      ['エバーグリーンでんき', 554.84, 832.26, 1109.68, 1387.10, 1664.52, 19.28,25.69,29.65],
      ['ふらっとでんき', 0, 0, 0, 0, 0, 26.3, 26.3, 26.3],
      ['ジニーエナジー',253,	429,	506,	632.5,	759,	24,	24,	24],
      ['東急でんき',"無し",	803,	1089,	1320,	1551,	19.77,	26.36,	29.57],
      ['TEPCO(従量電灯B)', 572,	858,	1144,	1430,	1716.00,	19.88,	26.48,	30.57],
      ['TEPCO(スタンダードSプラン)',	572,	858,	1144,	1430,	1716,	19.88,	26.46	,30.57],
      ['東北電力' , '無し',	858,	1144,	1430,	1716,	19.87,	24.94,	29.5],
      ['中国電力',	0,	0,	0,	0,	0,	25.78,	25.78,	25.78],
      ['ピタでん',	0,	0,	0,	0,	0,	25.71,	25.71,	25.71],
      ['あしたでんき',	0,	0,	0,	0,	0,	26,	26,	26],
      ['0円でんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['Looopでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['ゼロからでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['楽天でんき',	0,	0,	0,	0,	0, 26.5,	26.5,	26.5],
      ['パレット電気',	0,	0,	0,	0,	0, 27.2,	26.46,	27.77],
      ['Japan電力',	0,	0,	0,	0,	0, 26,	25.5,	24.5],
      ['ENEOSでんき',	572,	858,	1144,	1430,	1716,	19.88,	24.54,	26.22],
      ['ニチデン',	554.84,	832.26,	1109.68,	1387.1,	1664.52,	24.44,	25.16,	23.43],
      ['ニチデン',	543.4,	815.1,	1086.8,	1358.5,	1630.2,	25.77,	25.16,	23.43],
      ['auでんき',	572,	858,	1144,	1430,	1716,	19.87,	26.47,	30.56],
      ['UQでんき',	572,	858,	1144,	1430,	1716,	19.87,	26.47,	30.56],
      ['ソフトバンクでんき',	572,	858,	1144,	1430,	1716,	19.68,	26.21,	30.26],
      ['ソフトバンクでんき',	572,	858,	1144,	1430,	1716,	19.68,	25.68,	29.04],
      ['PinTでんき',	572,	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
      ['ライフでんき',	514.8,	772.2,	1029.6,	1287,	1544.4,	25.20, 25.20, 	25.20],
      ['セレクトでんき',514.8,	772.20,	1029.6,	1287,	1544.4,	25.20,	25.20, 	25.20],
      ['東京ガス',1572,	858,	1144,	1430,	1716,	23.67,	23.88,	26.41],
      ['まちエネ',	572,	858,	1144,	1430,	1716,	19.79,	25.27,	26.47],
      ['CDエナジー',	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
      ['スマ電' ,'なし', 858,	894,	930,	1216,	19.76,	25.87,	25.97],
      ['ミツウロコ',	572,	858,	1144,	1430,	1716,	21.83,	23.05,	25.71],
      ['丸紅電気',	803,	803,	1089,	1375,	1661,	19.78,	26.38,	26.38],
      ['九電みらいエナジー',	529.62,	794.43,	1059.24,	1324.05,	1588.86,	19.76,	25.67,	28.01],
      ['エルピオ電気', '無し',858.00,'無し','無し','無し',21.14,	23.03,	25.78],
      ['出光昭和シェル',	572,	858,	1144,	1430,	1716,	19.88,	24.44,	26.18],
      ['シン・エナジー', '無し',	768.34,	1024.45,	1280.56,	1536.68,	19.67,	24.78,	27.71],
      ['まるっとでんき',	554.84,	832.26,	1109.68,	1387.10,	1664.52,	24.97,	24.97,	24.97],
      ['エネワンでんき','無し',	825,	1100,	1375,	1650,	19.88,	26.48,	26.91],
      ['リミックスでんき','無し',		815.1,	1086.8,	1358.5,	1630.2,	18.88,	25.15,	29.04],
      ['エネアーク関東','無し',	840.84,	1094.81,	1365.65,	1630.2,	19.49,	25.96,	29.96],
      ['GREENaでんき',	858,	858,	1144,	1430,	1716,	19.88,	26.48,	30.58],
      ['エフビットでんき','無し',		815.1,	1086.8,	1358.5,	1630.2,	19.48,	25.15,	28.43],
      ['ファミリーエナジー',	286,	429,	572,	715,	858,	26.92,	26.92,	26.92],
      ['みんな電力'	,786,	929,	1072,	1215,	1358,	24.99,	24.99,	24.99],
      ['コープデリでんき',	572,	858,	1144,	1430,	1716,	19.65,	24.44,	25.91],
      ['エフエネ電気','無し', 	858,	1144,	1430,	1716,	20.08,	25.71,	28.28],
      ['カルガモでんき',	514.8,	772.2,	1029.6,	1287,	1544.4,	25.71,	25.71,	28.28],
      ['J:COM電力',	572,	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
      ['シナネン電気',	572,	858,	1144,	1430,	1716,	19.88,	26.48,	30.57],
    ];
  }else if(area_list1.value == "中部エリア") {
    companyData = [
      ['エバーグリーンでんき', 554.84,	832.26,	1109.68,	1387.10,	1664.52,	19.28,	25.69,	29.65],
      ['ふらっとでんき', 0, 0, 0, 0, 0, 26.3, 26.3, 26.3],
      ['ジニーエナジー',253.00,	379.05,	506.00,	632.50,	759.00,	24.50,	24.50,	24.50],
      ['TEPCO(スタンダードSプラン)', 572,	858,	1144,	1430,	1716,	21.03,	24.18,	27.52],
      ['ミライズ', '無し','無し',	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ['ミライズ', 572,	858,	'無し',	'無し',	'無し',	21.04,	25.51,	28.46],
      ['ピタでん',	0,	0,	0,	0,	0,	25.71,	25.71,	25.71],
      ['あしたでんき',	0,	0,	0,	0,	0,	26,	26,	26],
      ['0円でんき',	0,	0,	0,	0,	0, 26.3,	26.3,	26.3],
      ['Looopでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['ゼロからでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['楽天でんき',	0,	0,	0,	0,	0, 26.5,	26.5,	26.5],
      ['パレット電気',	0,	0,	0,	0,	0, 28.17,	25.51,	25.80],
      ['Japan電力',	0,	0,	0,	0,	0, 26,	25.5,	24.5],
      ['ENEOSでんき',	572,	858,	1144,	1430,	1716,	20.85,	24.77,	26.49],
      ['ニチデン',	554.84,	832.26,	1109.68,	1387.1,	1664.52,	24.44,	24.44,	24.44],
      ['ニチデン',	563.77,	815.1,	1086.8,	1358.5,	1630.2,	25.77,	25.16,	23.84],
      ['auでんき',	572,	858,	1144,	1430,	1716,	21.03,	25.50,	28.45],
      ['UQでんき',	572,	858,	1144,	1430,	1716,	21.03,	25.50,	28.45],
      ['ソフトバンクでんき',	572,	858,	1144,	1430,	1716,	20.82,	25.25,	28.17],
      ['ソフトバンクでんき',	572,	858,	1144,	1430,	1716,	20.82,	24.74,	27.03],
      ['PinTでんき',	572,	858,	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ['ライフでんき',	514.8,	772.2,	1029.6,	1287,	1544.4,	24.80,	24.80,	24.80],
      ['セレクトでんき',514.8,	772.20,	1029.6,	1287,	1544.4,	24.80,	24.80,	24.80],
      ['東邦ガス',547,	833,	991,	1277,	1563,	21.02,	25.16,	25.18],
      ['まちエネ',	572,	858,	1144,	1430,	1716,	20.97,	24.37,	24.67],
      ['スマ電' ,'無し', 558,	844,	1130,	1416,	20.95,	25.13,	26.76],
      ['ミツウロコ',	572,	858,	1144,	1430,	1716,	23.10,	23.40,	25.99],
      ['丸紅電気',	1089,	1089,	1089,	1375,	1661,	21.02,	25.49,	26.15],
      ['エルピオ電気','無し',	743.52,	937.04,	1171.29,	1497.22,	23.62,	23.62,	23.62],
      ['出光昭和シェル',	572,	858,	1144,	1430,	1716,	21.04,	24.93,	26.29],
      ['シン・エナジー', '無し',	824.95,	1101.59,	1375.25,	1649.91,	20.40,	23.87,	25.24],
      ['まるっとでんき',	554.84,	832.26,	1109.68,	1387.10,	1664.52,	25.99,	25.99,	25.99],
      ['エネワンでんき','無し',	825,	1100,	1375,	1650,	21.04,	23.98,	25.33],
      ['リミックスでんき','無し',		815.1,	1086.8,	1358.5,	1630.2,	19.98,	24.23,	27.03],
      ['エネアーク中部','無し',	766.35,	1021.8,	1277.25,	1532.7,	21.06,	25.30,	26.21],
      ['GREENaでんき',	858,	858,	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ['エフビットでんき','無し',		815.1,	1086.8,	1358.5,	1630.2,	20.61,	24.23,	26.46],
      ['ファミリーエナジー',253,	379.5,	506,	632.5,	759,	29.65,	29.65,	29.65],
      ['みんな電力'	,753,	879.5,	1006,	1132.5,	1259,	25.71,	25.71,	25.71],
      ['カルガモでんき',	514.8,	772.2,	1029.6,	1287,	1544.4,	24.78,	24.78,	24.78],
      ['エフエネ電気','無し', 	858,	1144,	1430,	1716,	21.26,	24.78,	26.62],
      ['シナネン電気',	572,	858,	1144,	1430,	1716,	21.04,	25.51,	28.46],
      ];
  }else if(area_list1.value == "東北エリア") {
    companyData = [
      ['エバーグリーンでんき','無し',	960.30,	1280.40,	1600.50,	1920.60,	18.02,	24.57,	28.40],
      ['ジニーエナジー',253,	379.05,	506,	632.5,	759,	23.50,	23.50,	23.50],
       ['TEPCO(スタンダードSプラン)',	660,	990,	1320,	1650,	1980,	18.55,	24.06,	28.41],
      ['東北電力', '無し',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['ピタでん',	0,	0,	0,	0,	0,	25.71,	25.71,	25.71],
      ['あしたでんき',	0,	0,	0,	0,	0,	26,	26,	26],
      ['Looopでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['ゼロからでんき',	0,	0,	0,	0,	0, 26.4,	26.4,	26.4],
      ['楽天でんき',	0,	0,	0,	0,	0, 26.5,	26.5,	26.5],
      ['パレット電気',	0,	0,	0,	0,	0, 26.82,	26.46,	26.57],
      ['Japan電力',	0,	0,	0,	0,	0, 26,	25.33,	24.50],
      ['ENEOSでんき',	660,	990,	1320,	1650,	1980,	18.38,	24.54,	26.22],
      ['ニチデン',	640.2,	960.3,	1280.4,	1600.5,	1920.6,	23.43,	23.43,	23.43],
      ['ニチデン',	627,	940.5,	1254,	1567.5,	1881,	24.96,	24.34,	23.12],
      ['auでんき',660, 990,	1320,	1650,	1980,	18.56,	25.32,	29.27],
      ['UQでんき',	660, 990,	1320,	1650,	1980,	18.56,	25.32,	29.27],
      ['ソフトバンクでんき',	660,	990,	1320,	1650,	1,980,	19.68,	25.68,	29.04],
      ['ソフトバンクでんき',660,	990,	1320,	1650,	1980,	19.68,	26.21,	30.26],
      ['PinTでんき',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['ライフでんき',	594,	891.2,	1188,	1485,	1782,	24.20,	24.20,	24.20],
      ['セレクトでんき',594,	891.2,	1188,	1485,	1782,	24.20,	24.20,	24.20],
      ['まちエネ',	660,	990,	1320,	1,650,	1,980,	18.50,	24.17,	25.35],
      ['ミツウロコ',	660,	990,	1320,	1650,	1980,	20.61,	23.22,	26.80],
      ['丸紅電気',	935,	935,	1265,	1595,	1925,	18.57,	25.33,	26.8],
      ['エルピオ電気', '無し',743.52,	937.04,	1171.29,	1497.22,	23.42,	23.42,	23.42],
      ['出光昭和シェル',	660,	990,	1320,	1650,	1980,	18.58,	24.65,	26.88],
      ['シン・エナジー', '無し',	980.83,	1307.78,	1633.7,	1960.65,	18.31,	24.42,	26.79],
      ['まるっとでんき',	640.2,	960.3,	1280.4,	1600.5,	1920.6,	24.94,	24.94,	24.94],
      ['エネワンでんき','無し',	957,	1276,	1595,	1914,	18.58,	25.33,	26.94],
      ['リミックスでんき','無し',	940.5,	1254,	1567.5,	1881,	17.65,	24.06,	27.82],
      ['GREENaでんき',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['エフビットでんき','無し',		940.5,	1254,	1567.5,	1881,	18.20,	24.06,	27.23],
      ['ファミリーエナジー',	253,	379.05,	506,	632.5,	759,	30.55,	30.55,	30.55],
      ['みんな電力'	,753,	929,	1006,	1132.5,	1259,	24.99,	24.99,	24.99],
      ['エフエネ電気','無し', 	990,	1320,	1650,	1980,	20.08,	25.71,	28.28],
      ['カルガモでんき',	594,	772.2,	1188,	1485,	1782,	25.71,	25.71,	25.71],
      ['J:COM電力',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ['シナネン電気',	660,	990,	1320,	1650,	1980,	18.58,	25.33,	29.28],
      ]
  }else if(area_list1.value == "九州エリア") {
    companyData = [
      ['エバーグリーンでんき','なし', 864.27, 1152.36, 1440.45, 1728.54, 16.94,22.37,25.28],
      ['ふらっとでんき', 0, 0, 0, 0, 0, 23.3, 23.3, 23.3],
      ['ジニーエナジー',253.00,	429.00,	506.00,	632.50,	759.00,	21.5,	21.5,	21.5],
      ['スマ電' ,594, 741,	1038,	1335,	1632,	17.46,	23.06,	26.06],
      ['スマートファミリープラン','',594,891,1188,1485,1782,17.46,23.06,24.96],
      ]
  }


  // スマホ版の切り替え先のアンペア数ごとに基本料金を変更する処理
let kanto_area = companyData[index - 1];
service_list3.textContent = kanto_area[0];
item_first3.textContent = kanto_area[6];
item_second3.textContent = kanto_area[7];
item_third3.textContent = kanto_area[8];

function capacityChange3(event){
  let capacity_value = event.currentTarget.value
  if(capacity_value == "20A") {
  var basic3 = item_Basic3.textContent = kanto_area[1];
  } else if (capacity_value == "30A") {
  var basic3 = item_Basic3.textContent = kanto_area[2];
  } else if (capacity_value == "40A") {
  var basic3 = item_Basic3.textContent = kanto_area[3];
  } else if (capacity_value == "50A") {
  var basic3 = item_Basic3.textContent = kanto_area[4];
  } else if (capacity_value == "60A") {
  var basic3 = item_Basic3.textContent = kanto_area[5];
  }
  consumption_text3.value = '';
  total_item3.innerHTML = '';

// スマホ版の切り替え先の使用量が入力されたときに電力料金が表示される処理
 consumption_text3.addEventListener('input',handleInput3)
 function handleInput3(event) {
if(event.target.value < 120){
  company_price = basic3 + kanto_area[6]* parseInt(event.target.value)
  total_item3.textContent = Math.round(company_price * 100) / 100;
} else if(event.target.value<300){
  company_price = basic3 +120*kanto_area[6]+kanto_area[7]*(event.target.value-120)
  total_item3.textContent = Math.round(company_price * 100) / 100;
} else if(event.target.value>=300) {
  company_price = basic3 +120*kanto_area[6]+180*kanto_area[7]+kanto_area[8]*(event.target.value-300)
  total_item3.textContent = Math.round(company_price *100 ) / 100;
}
}
}

let capacity = document.getElementById('capacity_list3');
capacity.addEventListener('change', capacityChange3);
});


// 実行ボタンが押された時に現電力会社と切り替え先の電力料金を計算する処理
function executionButton(){
  var border_text1 = document.getElementById('border_text1');
  var border_text2 = document.getElementById('border_text2');
  var border_text3 = document.getElementById('border_text3');
  var total1 = parseInt(total_item1.textContent);
  var total2 = parseInt(total_item2.textContent);
  var total3 = parseInt(total_item3.textContent);
  if(total1 > total2){
   border_text1.textContent = "¥"+Math.round(total1 - total2 )+ "オトク!!";
   border_text2.textContent = "¥"+Math.round(total1 - total2 )*12 + "オトク!!";
  } else if(total1 < total2) {
   border_text1.textContent = "¥"+Math.round(total2 - total1)+"高い";
   border_text2.textContent = "¥"+Math.round(total2 - total1) *12 + "高い";
  } else if(total1 == total2) {
    border_text1.textContent = "¥"+Math.round(total2 - total1);
    border_text2.textContent = "¥"+Math.round(total2 - total1) *12;
  }
  if(total1 > total3){
   border_text1.textContent = "¥"+Math.round(total1 - total3 )+ "オトク!!";
   border_text3.textContent = "¥"+Math.round(total1 - total3 )*12 + "オトク!!";
  } else if(total1 < total3) {
   border_text1.textContent = "¥"+Math.round(total3 - total1)+"高い";
   border_text3.textContent = "¥"+Math.round(total3 - total1) *12 + "高い";
  }else if(total1 == total3) {
    border_text1.textContent = "¥"+Math.round(total3 - total1);
    border_text3.textContent = "¥"+Math.round(total3 - total1) *12;
  }
}

// クリアボタンが押された時に全て空にする処理
function clearButton(){
  area_list1.value = 'エリアを選択してください';
  company_list1.value = 'エリアを選択してください';
  company_list1.disabled = true;
  service_list1.innerHTML = '';
  capacity_list1.value = '-';
  consumption_text1.value = '';
  item_Basic1.innerHTML = '';
  item_first1.innerHTML = '';
  item_second1.innerHTML = '';
  item_third1.innerHTML = '';
  total_item1.innerHTML = '';
  border_text1.innerHTML ='';
// 切り替え先
  area_list2.innerHTML = 'エリアを選択してください';
  company_list2.value = 'エリアを選択してください';
  company_list2.disabled = true;
  service_list2.innerHTML = '';
  capacity_list2.value = '-';
  consumption_text2.value = '';
  item_Basic2.innerHTML = '';
  item_first2.innerHTML = '';
  item_second2.innerHTML = '';
  item_third2.innerHTML = '';
  total_item2.innerHTML = '';
  border_text2.innerHTML ='';

  area_list3.innerHTML = 'エリアを選択してください';
  company_list3.value = 'エリアを選択してください';
  company_list3.disabled = true;
  service_list3.innerHTML = '';
  capacity_list3.value = '-';
  consumption_text3.value = '';
  item_Basic3.innerHTML = '';
  item_first3.innerHTML = '';
  item_second3.innerHTML = '';
  item_third3.innerHTML = '';
  total_item3.innerHTML = '';
  border_text3.innerHTML ='';
}






